{
    "Русский жестовый язык (РЖЯ)": "Естественный язык общения людей с нарушением слуха, использующий жесты и мимику для передачи информации.",
    "Распознавание жестов": "Технологический процесс, направленный на идентификацию и интерпретацию движений рук и пальцев с использованием алгоритмов машинного обучения и компьютерного зрения.",
    "Компьютерное зрение": "Область информатики, занимающаяся разработкой алгоритмов для извлечения, анализа и интерпретации визуальной информации из изображений или видеопотока.",
    "Машинное обучение": "Раздел искусственного интеллекта, включающий разработку алгоритмов, которые обучаются выполнять задачи на основе анализа данных, а не явного программирования.",
    "Глубинное обучение": "Подраздел машинного обучения, использующий многослойные нейронные сети для обработки и анализа сложных данных.",
    "Нейронные сети": "Вычислительные модели, вдохновленные принципами работы человеческого мозга, применяемые для классификации, прогнозирования и распознавания образов.",
    "Медиапайп (MediaPipe)": "Платформа с открытым исходным кодом для разработки и развертывания моделей компьютерного зрения, часто используемая для задач обработки видео и жестов.",
    "Классификация жестов": "Процесс определения категорий, к которым относится определенный жест, с использованием алгоритмов машинного обучения.",
    "Алгоритмы распознавания": "Набор методов и технологий, применяемых для идентификации объектов, жестов или данных на основе анализа их характеристик.",
    "Предобработка изображений": "Этап обработки данных, включающий преобразование изображений (например, изменение масштаба, фильтрацию) для повышения точности моделей машинного обучения.",
    "Обнаружение ключевых точек (keypoints)": "Процесс определения специфических точек на изображении, таких как суставы пальцев или контуры лица, для дальнейшего анализа.",
    "Конфигурация камеры": "Настройки и параметры работы камеры, которые влияют на качество и точность захвата изображений или видео.",
    "Точность модели": "Показатель, характеризующий, насколько точно модель машинного обучения выполняет поставленные задачи, измеряемый через метрики, такие как F1-score.",
    "Интерфейс пользователя (UI)": "Компоненты веб-приложения, обеспечивающие взаимодействие пользователя с системой, такие как кнопки, формы и визуальные элементы.",
    "Обратная связь (feedback)": "Результат работы системы, отображающий реакцию на действия пользователя, например, текстовый вывод на основе распознанного жеста.",
    "Интерпретация жестов": "Процесс преобразования распознанных движений рук и пальцев в понятный для пользователя текст или команды.",
    "Веб-приложение": "Программное обеспечение, которое функционирует через веб-браузер, предоставляя пользователю доступ к функционалу через интернет.",
    "Трансформация данных": "Процесс изменения исходных данных (например, нормализация) для улучшения их качества и пригодности для анализа.",
    "Технология JavaScript": "Язык программирования, используемый для создания динамических интерфейсов и выполнения задач машинного обучения на стороне клиента.",
    "Работа в реальном времени": "Обработка данных или выполнение операций, происходящих без значительных задержек, обеспечивая мгновенную реакцию системы."
  }